report/load_evaluation/ab/response_short/100c_10000req_proxy.txt
###############################
proxy 1
###############################

samiras-mbp:wrk samirarabbanian$
samiras-mbp:wrk samirarabbanian$ ab -n 10000 -c 100 http://127.0.0.1:1235/
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        127.0.0.1
Server Port:            1235

Document Path:          /
Document Length:        52 bytes

Concurrency Level:      100
Time taken for tests:   40.465 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      2910440 bytes
HTML transferred:       521872 bytes
Requests per second:    247.13 [#/sec] (mean)
Time per request:       404.645 [ms] (mean)
Time per request:       4.046 [ms] (mean, across all concurrent requests)
Transfer rate:          70.24 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   83 1072.4      0   14171
Processing:   251  320 897.3    255   14358
Waiting:       50  111 890.9     53   14152
Total:        251  404 1397.0    256   14428

Percentage of the requests served within a certain time (ms)
  50%    256
  66%    257
  75%    259
  80%    261
  90%    265
  95%    317
  98%    432
  99%  13658
 100%  14428 (longest request)
samiras-mbp:wrk samirarabbanian$

###############################
proxy 2
###############################

samiras-mbp:wrk samirarabbanian$ ab -n 10000 -c 100 http://127.0.0.1:1235/
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        127.0.0.1
Server Port:            1235

Document Path:          /
Document Length:        52 bytes

Concurrency Level:      100
Time taken for tests:   46.330 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      2900290 bytes
HTML transferred:       520052 bytes
Requests per second:    215.84 [#/sec] (mean)
Time per request:       463.300 [ms] (mean)
Time per request:       4.633 [ms] (mean, across all concurrent requests)
Transfer rate:          61.13 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  107 1470.5      0   20913
Processing:   251  354 1369.2    255   21168
Waiting:       50  148 1362.2     53   20821
Total:        251  461 2011.5    255   21314

Percentage of the requests served within a certain time (ms)
  50%    255
  66%    257
  75%    258
  80%    259
  90%    266
  95%    272
  98%    362
  99%  13804
 100%  21314 (longest request)
samiras-mbp:wrk samirarabbanian$